# 1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц).
# Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно —
# первый элемент первой строки первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.

class Matrix:
    def __init__(self, matrix):
        self.matrix = matrix

    def __add__(self, other):
        return Matrix([[self.matrix[i][j] + other.matrix[i][j]
                        for j in range(len(self.matrix[i]))]
                       for i in range(len(self.matrix))])

    def __str__(self):
        return 'Matrix:\n' + '\n'.join('\t'.join(map(str, i)) for i in self.matrix)


a1 = Matrix([[90, 2, 3],
             [5, 6, 7]])
a2 = Matrix([[1, 2, 3],
             [5, 6, 7]])
a3 = a1 + a2

print(a3)
print(a1 + a2)
